pengshulin/mcush/MindMotion/mm32f0/startup/inc/startup_mm32.h
////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1)
// Cortex-M core handlers
    #pragma weak NMI_Handler                        =   Dummy_Handler
    #pragma weak HardFault_Handler                  =   Dummy_Handler
    #pragma weak MemManage_Handler                  =   Dummy_Handler
    #pragma weak BusFault_Handler                   =   Dummy_Handler
    #pragma weak UsageFault_Handler                 =   Dummy_Handler
    #pragma weak SVC_Handler                        =   Dummy_Handler
    #pragma weak DebugMon_Handler                   =   Dummy_Handler
    #pragma weak PendSV_Handler                     =   Dummy_Handler
    #pragma weak SysTick_Handler                    =   Dummy_Handler

// Peripherals handlers
    #pragma weak WWDG_IWDG_IRQHandler               =   Dummy_Handler
    #pragma weak PVD_IRQHandler                     =   Dummy_Handler
    #pragma weak PWM_IRQHandler                     =   Dummy_Handler
    #pragma weak FLASH_IRQHandler                   =   Dummy_Handler
    #pragma weak RCC_IRQHandler                     =   Dummy_Handler
    #pragma weak EXTI0_1_IRQHandler                 =   Dummy_Handler
    #pragma weak EXTI2_3_IRQHandler                 =   Dummy_Handler
    #pragma weak EXTI4_15_IRQHandler                =   Dummy_Handler
    #pragma weak HWDIV_IRQHandler                   =   Dummy_Handler
    #pragma weak DMA1_Channel1_IRQHandler           =   Dummy_Handler
    #pragma weak DMA1_Channel2_3_IRQHandler         =   Dummy_Handler
    #pragma weak DMA1_Channel4_5_IRQHandler         =   Dummy_Handler
    #pragma weak ADC1_IRQHandler                    =   Dummy_Handler
    #pragma weak TIM1_BRK_UP_TRG_COM_IRQHandler     =   Dummy_Handler
    #pragma weak TIM1_CC_IRQHandler                 =   Dummy_Handler
    #pragma weak TIM2_IRQHandler                    =   Dummy_Handler
    #pragma weak TIM3_IRQHandler                    =   Dummy_Handler
    #pragma weak TIM8_BRK_UP_TRG_COM_IRQHandler     =   Dummy_Handler
    #pragma weak TIM8_CC_IRQHandler                 =   Dummy_Handler
    #pragma weak TIM14_IRQHandler                   =   Dummy_Handler
    #pragma weak ADC2_IRQHandler                    =   Dummy_Handler
    #pragma weak TIM16_IRQHandler                   =   Dummy_Handler
    #pragma weak TIM17_IRQHandler                   =   Dummy_Handler
    #pragma weak I2C1_IRQHandler                    =   Dummy_Handler
    #pragma weak COMP_1_2_3_4_5_IRQHandler          =   Dummy_Handler
    #pragma weak SPI1_IRQHandler                    =   Dummy_Handler
    #pragma weak SPI2_IRQHandler                    =   Dummy_Handler
    #pragma weak UART1_IRQHandler                   =   Dummy_Handler
    #pragma weak UART2_IRQHandler                   =   Dummy_Handler
    #pragma weak Cache_IRQHandler                   =   Dummy_Handler
#endif

////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0Q1)
// Cortex-M core handlers
    #pragma weak NMI_Handler                        =   Dummy_Handler
    #pragma weak HardFault_Handler                  =   Dummy_Handler
    #pragma weak MemManage_Handler                  =   Dummy_Handler
    #pragma weak BusFault_Handler                   =   Dummy_Handler
    #pragma weak UsageFault_Handler                 =   Dummy_Handler
    #pragma weak SVC_Handler                        =   Dummy_Handler
    #pragma weak DebugMon_Handler                   =   Dummy_Handler
    #pragma weak PendSV_Handler                     =   Dummy_Handler
    #pragma weak SysTick_Handler                    =   Dummy_Handler

// Peripherals handlers
    #pragma weak WWDG_IWDG_IRQHandler               =   Dummy_Handler
    #pragma weak PVD_IRQHandler                     =   Dummy_Handler
    #pragma weak PWM_IRQHandler                     =   Dummy_Handler
    #pragma weak FLASH_IRQHandler                   =   Dummy_Handler
    #pragma weak RCC_IRQHandler                     =   Dummy_Handler
    #pragma weak EXTI0_1_IRQHandler                 =   Dummy_Handler
    #pragma weak EXTI2_3_IRQHandler                 =   Dummy_Handler
    #pragma weak EXTI4_15_IRQHandler                =   Dummy_Handler
    #pragma weak HWDIV_IRQHandler                   =   Dummy_Handler
    #pragma weak DMA1_Channel1_IRQHandler           =   Dummy_Handler
    #pragma weak DMA1_Channel2_3_IRQHandler         =   Dummy_Handler
    #pragma weak DMA1_Channel4_5_IRQHandler         =   Dummy_Handler
    #pragma weak ADC_COMP_IRQHandler                =   Dummy_Handler
    #pragma weak TIM1_BRK_UP_TRG_COM_IRQHandler     =   Dummy_Handler
    #pragma weak TIM1_CC_IRQHandler                 =   Dummy_Handler
    #pragma weak TIM2_IRQHandler                    =   Dummy_Handler
    #pragma weak TIM3_IRQHandler                    =   Dummy_Handler
    #pragma weak TIM14_IRQHandler                   =   Dummy_Handler
    #pragma weak TIM16_IRQHandler                   =   Dummy_Handler
    #pragma weak TIM17_IRQHandler                   =   Dummy_Handler
    #pragma weak I2C1_IRQHandler                    =   Dummy_Handler
    #pragma weak SPI1_IRQHandler                    =   Dummy_Handler
    #pragma weak SPI2_IRQHandler                    =   Dummy_Handler
    #pragma weak UART1_IRQHandler                   =   Dummy_Handler
    #pragma weak UART2_IRQHandler                   =   Dummy_Handler
#endif

////////////////////////////////////////////////////////////////////////////////
// Exception Table
////////////////////////////////////////////////////////////////////////////////
#if (__KEIL)



#else
//#pragma language = extended
//#pragma segment = "CSTACK"
#endif
/// @}

////////////////////////////////////////////////////////////////////////////////
#ifdef _STARTUP_MM32_C_

#define GLOBAL
#else
#define GLOBAL extern
#endif

#undef GLOBAL

////////////////////////////////////////////////////////////////////////////////
/// @defgroup MM32_Exported_Functions
/// @{

void __iar_program_start(void);

int __low_level_init(void);
void Dummy_Handler(void);

////////////////////////////////////////////////////////////////////////////////
#if defined(__MM3N1)
    // Cortex-M core handlers
    void Reset_Handler(void);
    void NMI_Handler(void);
    void HardFault_Handler(void);
    void MemManage_Handler(void);
    void BusFault_Handler(void);
    void UsageFault_Handler(void);
    void SVC_Handler(void);
    void DebugMon_Handler(void);
    void PendSV_Handler(void);
    void SysTick_Handler(void);

    // Peripherals handlers
    void WWDG_IRQHandler(void);
    void PVD_IRQHandler(void);
    void TAMPER_IRQHandler(void);
    void RTC_IRQHandler(void);
    void FLASH_IRQHandler(void);
    void RCC_IRQHandler(void);
    void EXTI0_IRQHandler(void);
    void EXTI1_IRQHandler(void);
    void EXTI2_IRQHandler(void);
    void EXTI3_IRQHandler(void);
    void EXTI4_IRQHandler(void);
    void DMA1_Channel1_IRQHandler(void);
    void DMA1_Channel2_IRQHandler(void);
    void DMA1_Channel3_IRQHandler(void);
    void DMA1_Channel4_IRQHandler(void);
    void DMA1_Channel5_IRQHandler(void);
    void DMA1_Channel6_IRQHandler(void);
    void DMA1_Channel7_IRQHandler(void);
    void ADC1_2_IRQHandler(void);
    void USB_HP_CAN1_TX_IRQHandler(void);
    void USB_LP_CAN1_RX0_IRQHandler(void);
    void CAN1_RX1_IRQHandler(void);
    void CAN1_SCE_IRQHandler(void);
    void EXTI9_5_IRQHandler(void);
    void TIM1_BRK_IRQHandler(void);
    void TIM1_UP_IRQHandler(void);
    void TIM1_TRG_COM_IRQHandler(void);
    void TIM1_CC_IRQHandler(void);
    void TIM2_IRQHandler(void);
    void TIM3_IRQHandler(void);
    void TIM4_IRQHandler(void);
    void I2C1_EV_IRQHandler(void);
    void I2C1_ER_IRQHandler(void);
    void I2C2_EV_IRQHandler(void);
    void I2C2_ER_IRQHandler(void);
    void SPI1_IRQHandler(void);
    void SPI2_IRQHandler(void);
    void UART1_IRQHandler(void);
    void UART2_IRQHandler(void);
    void UART3_IRQHandler(void);
    void EXTI15_10_IRQHandler(void);
    void RTCAlarm_IRQHandler(void);
    void USBWakeUp_IRQHandler(void);
    void AESEncrupt_IRQHandler(void);
#endif

////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0N1)
    // Cortex-M core handlers
    void Reset_Handler(void);
    void NMI_Handler(void);
    void HardFault_Handler(void);
    void SVC_Handler(void);
    void PendSV_Handler(void);
    void SysTick_Handler(void);

    // Peripherals handlers
    void WWDG_IRQHandler(void);
    void PVD_IRQHandler(void);
//  void RTC_IRQHandler(void);
    void FLASH_IRQHandler(void);
    void RCC_CRS_IRQHandler(void);
    void EXTI0_1_IRQHandler(void);
    void EXTI2_3_IRQHandler(void);
    void EXTI4_15_IRQHandler(void);
    void DMA1_Channel1_IRQHandler(void);
    void DMA1_Channel2_3_IRQHandler(void);
    void DMA1_Channel4_5_IRQHandler(void);
    void ADC1_COMP_IRQHandler(void);
    void TIM1_BRK_UP_TRG_COM_IRQHandler(void);
    void TIM1_CC_IRQHandler(void);
    void TIM2_IRQHandler(void);
    void TIM3_IRQHandler(void);
    void TIM14_IRQHandler(void);
    void TIM16_IRQHandler(void);
    void TIM17_IRQHandler(void);
    void I2C1_IRQHandler(void);
    void SPI1_IRQHandler(void);
    void SPI2_IRQHandler(void);
    void UART1_IRQHandler(void);
    void UART2_IRQHandler(void);
    void AES_IRQHandler(void);
    void CAN_IRQHandler(void);
    void USB_IRQHandler(void);
#endif

////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0P1)
    // Cortex-M core handlers
    void Reset_Handler(void);
    void NMI_Handler(void);
    void HardFault_Handler(void);
    void MemManage_Handler(void);
    void BusFault_Handler(void);
    void UsageFault_Handler(void);
    void SVC_Handler(void);
    void DebugMon_Handler(void);
    void PendSV_Handler(void);
    void SysTick_Handler(void);

    // Peripherals handlers
    void WWDG_IWDG_IRQHandler(void);
    void PVD_IRQHandler(void);
    void PWM_IRQHandler(void);
    void FLASH_IRQHandler(void);
    void RCC_IRQHandler(void);
    void EXTI0_1_IRQHandler(void);
    void EXTI2_3_IRQHandler(void);
    void EXTI4_15_IRQHandler(void);
    void HWDIV_IRQHandler(void);
    void DMA1_Channel1_IRQHandler(void);
    void DMA1_Channel2_3_IRQHandler(void);
    void DMA1_Channel4_5_IRQHandler(void);
    void ADC1_IRQHandler(void);
    void TIM1_BRK_UP_TRG_COM_IRQHandler(void);
    void TIM1_CC_IRQHandler(void);
    void TIM2_IRQHandler(void);
    void TIM3_IRQHandler(void);
    void TIM8_BRK_UP_TRG_COM_IRQHandler(void);
    void TIM8_CC_IRQHandler(void);
    void TIM14_IRQHandler(void);
    void ADC2_IRQHandler(void);
    void TIM16_IRQHandler(void);
    void TIM17_IRQHandler(void);
    void I2C1_IRQHandler(void);
    void COMP_1_2_3_4_5_IRQHandler(void);
    void SPI1_IRQHandler(void);
    void SPI2_IRQHandler(void);
    void UART1_IRQHandler(void);
    void UART2_IRQHandler(void);
    void Cache_IRQHandler(void);
#endif

////////////////////////////////////////////////////////////////////////////////
#if defined(__MM0Q1)
    // Cortex-M core handlers
    void Reset_Handler(void);
    void NMI_Handler(void);
    void HardFault_Handler(void);
    void MemManage_Handler(void);
    void BusFault_Handler(void);
    void UsageFault_Handler(void);
    void SVC_Handler(void);
    void DebugMon_Handler(void);
    void PendSV_Handler(void);
    void SysTick_Handler(void);

    // Peripherals handlers
    void WWDG_IWDG_IRQHandler(void);
    void PVD_IRQHandler(void);
    void PWM_IRQHandler(void);
    void FLASH_IRQHandler(void);
    void RCC_IRQHandler(void);
    void EXTI0_1_IRQHandler(void);
    void EXTI2_3_IRQHandler(void);
    void EXTI4_15_IRQHandler(void);
    void HWDIV_IRQHandler(void);
    void DMA1_Channel1_IRQHandler(void);
    void DMA1_Channel2_3_IRQHandler(void);
    void DMA1_Channel4_5_IRQHandler(void);
    void ADC_COMP_IRQHandler(void);
    void TIM1_BRK_UP_TRG_COM_IRQHandler(void);
    void TIM1_CC_IRQHandler(void);
    void TIM2_IRQHandler(void);
    void TIM3_IRQHandler(void);
    void TIM14_IRQHandler(void);
    void TIM16_IRQHandler(void);
    void TIM17_IRQHandler(void);
    void I2C1_IRQHandler(void);
    void SPI1_IRQHandler(void);
    void SPI2_IRQHandler(void);
    void UART1_IRQHandler(void);
    void UART2_IRQHandler(void);
#endif


/// @}


/// @}

/// @}

////////////////////////////////////////////////////////////////////////////////
#endif
////////////////////////////////////////////////////////////////////////////////
